import pprint
import re

'''
1 - Є 3 группи людей(sets) australia_blacklist, poker_blacklist, alcohol_blacklist.
В кожній групі вказані імена. Вивести тих хто виграв джекпот(є одразу в 3х списках)


2 - Порахувати та вивести(print) кількість букв в строці
Юзер щось вводить(input)
Ваша задача надрукувати кількість кожного символу того що він ввів.
Прикдад:
Юзер вводить:
My name is Emmy Santiago.
ВИ прінтаете щось накшталт:
M = 1, y = 2, n = 2, ...(або в іншому форматі, це не принциповоб головне, що б чітко було зрозуміло скільки разів зустрічаеться кожна буква)

Тобто кожну букву та скільки разів вона зустрічаеться
Підказка: це про словники, get можна використати для тотго щоб витягнути чи є ключ без помилки та надати дефолтне значення

3 - Вирішити задачу 2 без словника за 2 строки:
1 строка це input
2 строка це рішення
'''

# task 1
australia_blacklist = {"John Smith", "Emily Davis", "Michael Johnson", "Sophia Brown", "David Wilson", "Jack Miller"}
poker_blacklist = {"Emily Davis", "David Wilson", "Isabella Clark", "Michael Johnson", "Jack Miller", "Liam Evans"}
alcohol_blacklist = {"Michael Johnson", "David Wilson", "Jack Miller", "Olivia Martin", "Lucas Taylor"}

jackpot = set(australia_blacklist).intersection(set(poker_blacklist).intersection(alcohol_blacklist))
print(jackpot)

# task 2
word = (re.sub(r'[^\w]', '', input('>>> ').lower()))

pprint.pprint(dict(set((i, word.count(i)) for i in word)))

# task 3
word = input('>>> ').replace(' ', '').replace(' ', '').replace(',', '').replace('.', '').lower()
pprint.pprint(set((i, word.count(i)) for i in word))

'''
1) Користувач вводить слово, якщо це слово є поліндромом, вивести '+', інакше '-'
2) Написати валідатор для пошти. Користувач вводить пошту, а програма повинна перевірити:
- в адресі є тільки 1 '@', після '@' йде тільки 1 '.'
Не використовувати RE
Якщо умови виконані, то вивести "пошта валідна", інкше вивести "пошта не валідна"

3)
Додати перевірку введеної IP-адреси. Адреса вважається коректно заданою, якщо вона:
складається з 4 чисел (а не літер чи інших символів)
числа розділені точкою
кожне число в діапазоні від 0 до 255 Якщо адреса неправильна, виводьте повідомлення: «Неправильна IP-адреса». 
Повідомлення "Неправильна IP-адреса" має виводитися лише один раз, навіть якщо кілька пунктів вище не виконані.


в завданні 3 можна піти через re, а можна і без них обійтись. Звісно цікавіше без них, бо з ними то дуже просто
'''
